import { Question } from "./types";

export const questions: Question[] = [
    {
      question: "Къде се намира обектът от снимката?",
      imageSrc: "/game-question-images/question1_TheEiffelTower.jpg",
      options: ["Германия", "Франция", "САЩ"],
      correctAnswer: "Франция",
      subQuestions: [
        {
          question: "Каква е основната причина за построяването на Айфеловата кула?",
          options: [
            "За Световното изложение през 1889 г.",
            "За отбелязване на победа във война",
            "За научни експерименти",
          ],
          correctAnswer: "За Световното изложение през 1889 г.",
        },
        {
          question: "Колко време е отнело построяването на кулата?",
          options: ["2 години", "5 години", "3 години"],
          correctAnswer: "2 години",
        },
        {
          question: "Какво е било предназначението на кулата след изтичането на първоначалния ѝ договор?",
          options: [
            "Да бъде демонтирана",
            "Да се използва за жилищни нужди",
            "Да се превърне в паметник на инженерството",
          ],
          correctAnswer: "Да бъде демонтирана",
        },
      ],
    },
    {
      question: "Къде се намира обектът от снимката?",
      imageSrc: "/game-question-images/question2_TheGreatWallOfChina.jpg",
      options: ["Китай", "Камоджа", "Нидерландия"],
      correctAnswer: "Китай",
      subQuestions: [
        {
          question: "Каква е основната цел на Великата китайска стена?",
          options: [
            "За защита от нашествия",
            "За отбелязване на граници",
            "За контролиране на търговските пътища",
          ],
          correctAnswer: "За защита от нашествия",
        },
        {
          question: "През коя династия стената е достигнал най-голямата си дължина?",
          options: ["Династия Мин", "Династия Хан", "Династия Сун"],
          correctAnswer: "Династия Мин",
        },
        {
          question: "Каква уникална характеристика притежават Великата китайска стена?",
          options: [
            "Използвани са за предаване на съобщения чрез дим и светлина",
            "Имат подземни тунели, свързващи ги",
            "Всяка кула е изработена от различни материали",
          ],
          correctAnswer: "Използвани са за предаване на съобщения чрез дим и светлина",
        },
      ],
    },
    {
      question: "Къде се намира обектът от снимката?",
      imageSrc: "/game-question-images/question3_TheColosseum.jpg",
      options: ["Италия", "Хърватия", "Швеция"],
      correctAnswer: "Италия",
      subQuestions: [
        {
          question: "Каква е основната функция на Колизеума?",
          options: [
            "Провеждане на гладиаторски игри",
            "Организиране на театрални постановки",
            "Място за религиозни ритуали",
          ],
          correctAnswer: "Провеждане на гладиаторски игри",
        },
        {
          question: "Каква иновация е използвана за покриването на арената?",
          options: [
            "Велариум (платнен покрив)",
            "Стъклен покрив",
            "Дървени греди с плочки",
          ],
          correctAnswer: "Велариум (платнен покрив)",
        },
        {
          question: "Каква инженерна техника е използвана за бързото влизане и излизане на зрителите?",
          options: [
            "Сложна система от входове и изходи",
            "Въртящи се врати",
            "Тунели под арената",
          ],
          correctAnswer: "Сложна система от входове и изходи",
        },
      ],
    },
    {
      question: "Къде се намира обектът от снимката?",
      imageSrc: "/game-question-images/question4_TheStatueOfLiberty.jpg",
      options: ["САЩ", "Боливия", "Канада"],
      correctAnswer: "САЩ",
      subQuestions: [
        {
          question: "Кой е проектирал външния облик на статуята?",
          options: [
            "Фредерик Огюст Бартолди",
            "Александър Гюстав Айфел",
            "Пол Ландовски",
          ],
          correctAnswer: "Фредерик Огюст Бартолди",
        },
        {
          question: "Каква е основната символика на факлата?",
          options: [
            "Символ на просветлението и свободата",
            "Победа във война",
            "Напредък на науката",
          ],
          correctAnswer: "Символ на просветлението и свободата",
        },
        {
          question: "Какъв материал е използван за външната обвивка на статуята?",
          options: ["Мед", "Желязо", "Бронз"],
          correctAnswer: "Мед",
        },
      ],
    },
    {
      question: "Къде се намира обектът от снимката?",
      imageSrc: "/game-question-images/question5_MachuPicchu.jpg",
      options: ["Бразилия", "Аржентина", "Перу"],
      correctAnswer: "Перу",
      subQuestions: [
        {
          question: "Какво е уникалното в земеделските техники на Мачу Пикчу?",
          options: [
            "Терасиране",
            "Използване на естествени резервоари",
            "Мобилни напоителни системи",
          ],
          correctAnswer: "Терасиране",
        },
        {
          question: "Коя цивилизация е построила Мачу Пикчу?",
          options: ["Инките", "Маите", "Ацтеките"],
          correctAnswer: "Инките",
        },
        {
          question: "Какъв е вероятният мотив за изоставянето на комплекса?",
          options: [
            "Испанските завоевания",
            "Липсата на ресурси",
            "Природно бедствие",
          ],
          correctAnswer: "Испанските завоевания",
        },
      ],
    },
    {
      question: "Къде се намира обектът от снимката?",
      imageSrc: "/game-question-images/question6_TajMahal.jpg",
      options: ["Индия", "Оман", "Йемен"],
      correctAnswer: "Индия",
      subQuestions: [
        {
          question: "Каква е основната цел на построяването на Тадж Махал?",
          options: ["Гробница", "Резиденция за кралското семейство", "Религиозен храм"],
          correctAnswer: "Гробница",
        },
        {
          question: "Колко години е отнело изграждането на комплекса?",
          options: ["22 години", "15 години", "10 години"],
          correctAnswer: "22 години",
        },
        {
          question: "Какви материали са използвани за декорацията на фасадата?",
          options: ["Полускъпоценни камъни", "Боядисан мрамор", "Дърворезба"],
          correctAnswer: "Полускъпоценни камъни",
        },
      ],
    },
    {
      question: "Къде се намира обектът от снимката?",
      imageSrc: "/game-question-images/question7_TheSydneyOpera.jpg",
      options: ["Австрия", "Нова Зеландия", "Австралия"],
      correctAnswer: "Австралия",
      subQuestions: [
        {
          question: "Кой архитект е проектирал Сиднейската опера?",
          options: ["Йорн Утсон", "Франк Лойд Райт", "Норман Фостър"],
          correctAnswer: "Йорн Утсон",
        },
        {
          question: "Каква е основната структура на покрива?",
          options: ["Сглобяем бетон", "Стоманени арки", "Дървени плоскости"],
          correctAnswer: "Сглобяем бетон",
        },
        {
          question: "Каква е причината за забавянето на проекта?",
          options: [
            "Финансови и технически затруднения",
            "Липса на работна ръка",
            "Проблеми с доставката на материали",
          ],
          correctAnswer: "Финансови и технически затруднения",
        },
      ],
    },
    {
      question: "Къде се намира обектът от снимката?",
      imageSrc: "/game-question-images/question8_JesusChristStatue.jpg",
      options: ["Аржентина", "Бразилия", "Чили"],
      correctAnswer: "Бразилия",
      subQuestions: [
        {
          question: "Каква е целта на изграждането на статуята?",
          options: [
            "Символ на християнската вяра",
            "Мемориал за загинали във война",
            "Туристическа атракция",
          ],
          correctAnswer: "Символ на християнската вяра",
        },
        {
          question: "От какъв материал е външната повърхност на статуята?",
          options: ["Камък", "Мрамор", "Гранит"],
          correctAnswer: "Камък",
        },
        {
          question: "Как е финансирана статуята?",
          options: [
            "Дарения от католическата църква",
            "Държавен бюджет",
            "Частни инвеститори",
          ],
          correctAnswer: "Дарения от католическата църква",
        },
      ],
    },
    {
      question: "Къде се намира обектът от снимката?",
      imageSrc: "/game-question-images/question9_TheGizaPyramids.jpg",
      options: ["Египет", "Намибия", "Либия"],
      correctAnswer: "Египет",
      subQuestions: [
        {
          question: "Коя е най-голямата пирамида в Гиза?",
          options: ["Пирамидата на Хеопс", "Пирамидата на Хефрен", "Пирамидата на Микерин"],
          correctAnswer: "Пирамидата на Хеопс",
        },
        {
          question: "Каква е основната функция на пирамидите?",
          options: ["Гробници за фараоните", "Храмови постройки", "Символични монументи"],
          correctAnswer: "Гробници за фараоните",
        },
        {
          question: "Как е ориентирана Голямата пирамида?",
          options: ["По четирите посоки на света", "Към звездите", "По течението на Нил"],
          correctAnswer: "По четирите посоки на света",
        },
      ],
    },
    {
      question: "Къде се намира обектът от снимката?",
      imageSrc: "/game-question-images/question10_TheAngkorWat.jpg",
      options: ["Тайланд", "Камбоджа", "Виетнам"],
      correctAnswer: "Камбоджа",
      subQuestions: [
        {
          question: "Коя религия е първоначално свързана с Анкор Ват?",
          options: ["Хиндуизъм", "Будизъм", "Джайнизъм"],
          correctAnswer: "Хиндуизъм",
        },
        {
          question: "Каква е символиката на централната кула?",
          options: ["Центърът на вселената", "Домът на боговете", "Райската градина"],
          correctAnswer: "Центърът на вселената",
        },
        {
          question: "Каква е причината за западната ориентация на Анкор Ват?",
          options: [
            "Свързана е със смъртта и отвъдното",
            "Представя залеза на империята",
            "Позволява по-добра защита срещу нашественици",
          ],
          correctAnswer: "Свързана е със смъртта и отвъдното",
        },
      ],
    },
  ];